Tutorials/BFS_OpenFOAM/bfs_DDES_300k/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------


restore0Dir

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

rm -rf processor*

#------------------------------------------------------------------------------
